In [1]:
# 데이터 분석에 사용되는 표준라이브러리 로딩작업
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
# import matplotlib as mpl

In [2]:
# 1차원 배열 : 시리즈(Series) = 값(values)과 인덱스(index)
sr = pd.Series([17000, 18000, 1000, 5000],
               index=["피자", "치킨", "콜라", "맥주"])
sr

피자    17000
치킨    18000
콜라     1000
맥주     5000
dtype: int64

In [3]:
type(sr) # 객체의 자료형

pandas.core.series.Series

In [4]:
# 데이터값만 추출
sr.values

array([17000, 18000,  1000,  5000], dtype=int64)

In [5]:
# 인덱스만 추출
sr.index

Index(['피자', '치킨', '콜라', '맥주'], dtype='object')

In [6]:
# 2차원 배열 : 데이터프레임(DataFrame)
# 행(index)와 열(column) 그리고 값(values)
values = [[1, 2, 3],[4, 5, 6],[7, 8, 9]]
index = ['one', 'two', 'three']
columns = ['A', 'B', 'C']

df = pd.DataFrame(values, 
                  index=index, 
                  columns=columns)
df

       A  B  C
one    1  2  3
two    4  5  6
three  7  8  9

In [7]:
df.index

Index(['one', 'two', 'three'], dtype='object')

In [8]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [9]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]], dtype=int64)

In [10]:
# 데이터프레임 : 리스트, 시리즈, 딕셔너리, 넘파이배열 등으로 생성
# 리스트를 이용한 데이터 프레임 생성
data = [
    ['1000', 'Steve', 90.72],
    ['1001', 'James', 78.09],
    ['1002', 'Doyeon', 98.43],
    ['1003', 'Jane', 64.19],
    ['1004', 'Pilwoong', 81.30],
    ['1005', 'Tony', 99.14]
]

df = pd.DataFrame(data)
df

      0         1      2
0  1000     Steve  90.72
1  1001     James  78.09
2  1002    Doyeon  98.43
3  1003      Jane  64.19
4  1004  Pilwoong  81.30
5  1005      Tony  99.14

In [11]:
df = pd.DataFrame(data, columns=['학번', '이름', '점수'])
df

     학번        이름     점수
0  1000     Steve  90.72
1  1001     James  78.09
2  1002    Doyeon  98.43
3  1003      Jane  64.19
4  1004  Pilwoong  81.30
5  1005      Tony  99.14

In [12]:
# 딕셔너리를 이용한 데이터프레임 생성
data = {
    '학번':['1000', '1001','1002','1003','1004','1005'],
    '이름':['aaa','bbb','ccc','ddd','eee','fff'],
    '점수':[90.72, 78.09,98.43, 64.19, 81.30, 99.14]
}

df = pd.DataFrame(data)
df

     학번   이름     점수
0  1000  aaa  90.72
1  1001  bbb  78.09
2  1002  ccc  98.43
3  1003  ddd  64.19
4  1004  eee  81.30
5  1005  fff  99.14

In [13]:
# 데이터프레임 조회하는 작업
# df.head(n) : 데이터프레임의 앞에서 n개의 자료만 추출
# head(df, n)
# df.tail(n) : 데이터프레임의 뒷부분에 n개의 자료만 추출 
# df['열이름'] : 해당 열을 추출

In [14]:
df.head()

     학번   이름     점수
0  1000  aaa  90.72
1  1001  bbb  78.09
2  1002  ccc  98.43
3  1003  ddd  64.19
4  1004  eee  81.30

In [15]:
df.head(3)

     학번   이름     점수
0  1000  aaa  90.72
1  1001  bbb  78.09
2  1002  ccc  98.43

In [16]:
df.tail(3)

     학번   이름     점수
3  1003  ddd  64.19
4  1004  eee  81.30
5  1005  fff  99.14

In [17]:
df['학번']

0    1000
1    1001
2    1002
3    1003
4    1004
5    1005
Name: 학번, dtype: object

In [18]:
# 학번과 이름만 추출
df[['학번','이름']]

     학번   이름
0  1000  aaa
1  1001  bbb
2  1002  ccc
3  1003  ddd
4  1004  eee
5  1005  fff

In [22]:
# 데이터프레임[행인덱스, 열인덱스]
df.loc[1]

학번     1001
이름      bbb
점수    78.09
Name: 1, dtype: object

In [23]:
# loc[행인덱스값, 열인덱스값], 라벨값 기반의 2차원 인덱싱
# df.loc[행인덱싱값] or df.loc[행인덱싱값, 열인덱싱값]
# iloc : 순서를 기반으로 정수 기반의 2차원 인덱싱

In [24]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                 index = ['a','b','c'],
                 columns = ['A','B','C','D'])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [25]:
# loc 인덱서를 사용할 때 하나의 값만 있다면 행을 선택
df.loc['a']

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [27]:
df.loc['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [29]:
#df[행조건식, 열조건식]
df['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [30]:
df.loc[['b','c']]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [31]:
df.A > 15

a    False
b    False
c     True
Name: A, dtype: bool

In [32]:
df.loc[df.A > 15]

    A   B   C   D
c  18  19  20  21

In [33]:
def select_rows(df):
    return df.A > 15

In [34]:
select_rows(df)

a    False
b    False
c     True
Name: A, dtype: bool

In [35]:
df.loc[select_rows(df)]

    A   B   C   D
c  18  19  20  21

In [39]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),                 
                 columns = ['A','B','C','D'])
df

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21

In [40]:
df.loc[1:2]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

In [41]:
df.loc[1, 'A']

14

In [43]:
df.loc[1, :]

A    14
B    15
C    16
D    17
Name: 1, dtype: int32

In [44]:
df.loc[1:, 'A']

1    14
2    18
Name: A, dtype: int32

In [45]:
df.loc[[0, 1], ['B', 'D']]

    B   D
0  11  13
1  15  17

In [46]:
df.loc[df.A > 10, ['C', 'D']]

    C   D
1  16  17
2  20  21

In [47]:
df = pd.DataFrame({
    "체중":[80, 70, 65, 55, 52],
    "신장":[180, 177, 169, 190, 155],
    "성별":["남", "여", "남", "여", "남"]
})
df

   체중   신장 성별
0  80  180  남
1  70  177  여
2  65  169  남
3  55  190  여
4  52  155  남

In [48]:
df['신장']

0    180
1    177
2    169
3    190
4    155
Name: 신장, dtype: int64

In [49]:
df[['체중','신장']]

   체중   신장
0  80  180
1  70  177
2  65  169
3  55  190
4  52  155

In [50]:
df[df.성별 == '남']

   체중   신장 성별
0  80  180  남
2  65  169  남
4  52  155  남

In [51]:
df[df.성별 == '여']

   체중   신장 성별
1  70  177  여
3  55  190  여

In [53]:
data = {
    "names":['홍길동', '이순신','장보고','김유신','강감찬'],
    "year":[2014,2015,2016,2017,2018],
    "points":[1.5, 1.7, 3.6, 2.4, 2.9]
}

df = pd.DataFrame(data)
df

  names  year  points
0   홍길동  2014     1.5
1   이순신  2015     1.7
2   장보고  2016     3.6
3   김유신  2017     2.4
4   강감찬  2018     2.9

In [54]:
# 데이터 프레임의 정보확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
names     5 non-null object
year      5 non-null int64
points    5 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 200.0+ bytes

In [55]:
# 수치형데이터 기초통계분석
df.describe()

              year    points
count     5.000000  5.000000
mean   2016.000000  2.420000
std       1.581139  0.864292
min    2014.000000  1.500000
25%    2015.000000  1.700000
50%    2016.000000  2.400000
75%    2017.000000  2.900000
max    2018.000000  3.600000

In [56]:
# 데이터의 갯수를 세는 메서드 : count(), NaN 값은 세지않는다.
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [57]:
s.count()

9

In [59]:
# 인덱스의 이름 변경
df.index.name = "Nid"
# 열인덱스의 이름 변경
df.columns.name = "Info"
df

Info names  year  points
Nid
0      홍길동  2014     1.5
1      이순신  2015     1.7
2      장보고  2016     3.6
3      김유신  2017     2.4
4      강감찬  2018     2.9

In [60]:
# columns : 열 이름을 목록으로 추출
# index : 행 인덱스의 목록을 추출
# NaN : Not a Number

df2 = pd.DataFrame(data, 
                  columns=["year", "names", "points", "penalty"],
                  index = ['one', 'two', 'three', 'four', 'five'])
df2

       year names  points penalty
one    2014   홍길동     1.5     NaN
two    2015   이순신     1.7     NaN
three  2016   장보고     3.6     NaN
four   2017   김유신     2.4     NaN
five   2018   강감찬     2.9     NaN

In [61]:
df2["year"]

one      2014
two      2015
three    2016
four     2017
five     2018
Name: year, dtype: int64

In [62]:
df2.year

one      2014
two      2015
three    2016
four     2017
five     2018
Name: year, dtype: int64

In [63]:
df2[["year", "points"]]

       year  points
one    2014     1.5
two    2015     1.7
three  2016     3.6
four   2017     2.4
five   2018     2.9

In [64]:
df2['penalty'] = 0.7
df2

       year names  points  penalty
one    2014   홍길동     1.5      0.7
two    2015   이순신     1.7      0.7
three  2016   장보고     3.6      0.7
four   2017   김유신     2.4      0.7
five   2018   강감찬     2.9      0.7

In [65]:
df2['penalty'] = [0.5, 0.7, 0.9, 1.0, 0.6]
df2

       year names  points  penalty
one    2014   홍길동     1.5      0.5
two    2015   이순신     1.7      0.7
three  2016   장보고     3.6      0.9
four   2017   김유신     2.4      1.0
five   2018   강감찬     2.9      0.6

In [66]:
df2['ages'] = np.arange(10, 15)
df2

       year names  points  penalty  ages
one    2014   홍길동     1.5      0.5    10
two    2015   이순신     1.7      0.7    11
three  2016   장보고     3.6      0.9    12
four   2017   김유신     2.4      1.0    13
five   2018   강감찬     2.9      0.6    14

In [67]:
del df2['ages']
df2

       year names  points  penalty
one    2014   홍길동     1.5      0.5
two    2015   이순신     1.7      0.7
three  2016   장보고     3.6      0.9
four   2017   김유신     2.4      1.0
five   2018   강감찬     2.9      0.6

In [68]:
# [start:end-1]
df2[0:3]

       year names  points  penalty
one    2014   홍길동     1.5      0.5
two    2015   이순신     1.7      0.7
three  2016   장보고     3.6      0.9

In [70]:
df2.loc['two']

year       2015
names       이순신
points      1.7
penalty     0.7
Name: two, dtype: object

In [71]:
df2.loc['two':'four']

       year names  points  penalty
two    2015   이순신     1.7      0.7
three  2016   장보고     3.6      0.9
four   2017   김유신     2.4      1.0

In [72]:
# loc[행범위, 열범위]
# 범위 => start:end, :(all)
df2.loc[:, ['year','names']]

       year names
one    2014   홍길동
two    2015   이순신
three  2016   장보고
four   2017   김유신
five   2018   강감찬

In [74]:
# iloc : 숫자 인덱스를 이용
df2.iloc[3]

year       2017
names       김유신
points      2.4
penalty       1
Name: four, dtype: object

In [75]:
df2.loc['four']

year       2017
names       김유신
points      2.4
penalty       1
Name: four, dtype: object

In [77]:
# iloc[행범위, 열범위]
df2.iloc[3:5, 0:2]

      year names
four  2017   김유신
five  2018   강감찬

In [78]:
df2.iloc[:, 1:4]

      names  points  penalty
one     홍길동     1.5      0.5
two     이순신     1.7      0.7
three   장보고     3.6      0.9
four    김유신     2.4      1.0
five    강감찬     2.9      0.6

In [79]:
df2.iloc[1,1]

'이순신'

In [80]:
df2

       year names  points  penalty
one    2014   홍길동     1.5      0.5
two    2015   이순신     1.7      0.7
three  2016   장보고     3.6      0.9
four   2017   김유신     2.4      1.0
five   2018   강감찬     2.9      0.6

In [81]:
df2["year"]

one      2014
two      2015
three    2016
four     2017
five     2018
Name: year, dtype: int64

In [82]:
df2["year"] > 2016

one      False
two      False
three    False
four      True
five      True
Name: year, dtype: bool

In [83]:
df2.loc[df2["year"] > 2016, :]

      year names  points  penalty
four  2017   김유신     2.4      1.0
five  2018   강감찬     2.9      0.6

In [84]:
# 6 x 4
df = pd.DataFrame(np.random.randn(6, 4))
df

          0         1         2         3
0 -1.219021 -1.411936  0.089902  0.141695
1  0.250393  0.838954 -1.296464  0.203905
2 -0.528547 -1.987847  0.749464  0.290672
3  0.969858 -1.880601 -0.419586  0.148980
4  0.621354  0.716410  1.220786  2.147245
5 -0.188115  1.103585 -0.209557 -1.968617

In [85]:
# 생성된 데이터프레임에 열인덱스와 행인덱스 값
df.columns = ['A', 'B', 'C', 'D']
# date_range("시작날짜", 옵션)
df.index = pd.date_range("20210419", periods = 6)
df

                   A         B         C         D
2021-04-19 -1.219021 -1.411936  0.089902  0.141695
2021-04-20  0.250393  0.838954 -1.296464  0.203905
2021-04-21 -0.528547 -1.987847  0.749464  0.290672
2021-04-22  0.969858 -1.880601 -0.419586  0.148980
2021-04-23  0.621354  0.716410  1.220786  2.147245
2021-04-24 -0.188115  1.103585 -0.209557 -1.968617

In [86]:
# D 컬럼을 삭제하는 작업
# axis = 1, 열
# axis = 0, 행
df.drop('D', axis = 1)

                   A         B         C
2021-04-19 -1.219021 -1.411936  0.089902
2021-04-20  0.250393  0.838954 -1.296464
2021-04-21 -0.528547 -1.987847  0.749464
2021-04-22  0.969858 -1.880601 -0.419586
2021-04-23  0.621354  0.716410  1.220786
2021-04-24 -0.188115  1.103585 -0.209557

In [87]:
# B, C 컬럼 삭제
df.drop(['B', 'C'], axis = 1)

                   A         D
2021-04-19 -1.219021  0.141695
2021-04-20  0.250393  0.203905
2021-04-21 -0.528547  0.290672
2021-04-22  0.969858  0.148980
2021-04-23  0.621354  2.147245
2021-04-24 -0.188115 -1.968617

In [88]:
df = pd.DataFrame({
    "weight":[80, 70.4, 65.5, 45.9, 51.2],
    "height":[170, 180, 155, 143, 154]
})
df

   weight  height
0    80.0     170
1    70.4     180
2    65.5     155
3    45.9     143
4    51.2     154

In [89]:
# 세로방향으로 합계를 구하는 작업, 컬럼별 합계
df.sum(axis=0)

weight    313.0
height    802.0
dtype: float64

In [90]:
# 가로방향의 합계(각 행의 합계)
df.sum(axis=1)

0    250.0
1    250.4
2    220.5
3    188.9
4    205.2
dtype: float64

In [93]:
# 신장의 평균값
df['height'].mean()

160.4

In [94]:
# 체중의 평균
df['weight'].mean()

62.6

In [95]:
# 분산
df['height'].var()

212.3

In [96]:
# value_counts : 각각의 값의 출현빈도수를 계산하는 메서드
s = pd.Series(np.random.randint(6, size=100))
s.tail()

95    2
96    2
97    4
98    3
99    5
dtype: int32

In [97]:
s.value_counts()

4    25
3    21
1    14
0    14
5    13
2    13
dtype: int64

In [98]:
# 데이터 정렬 : sort_index와  sort_values
# sort_index : 인덱스를 기준
# sort_values : 데이터 값을 기준
# 내림차순 : ascending=False
# by = 열
s.value_counts().sort_index()

0    14
1    14
2    13
3    21
4    25
5    13
dtype: int64

In [99]:
s.value_counts().sort_values(ascending=False)

4    25
3    21
0    14
1    14
2    13
5    13
dtype: int64

In [100]:
df

   weight  height
0    80.0     170
1    70.4     180
2    65.5     155
3    45.9     143
4    51.2     154

In [102]:
# 체중을 이용해서 정렬
df["weight"]

0    80.0
1    70.4
2    65.5
3    45.9
4    51.2
Name: weight, dtype: float64

In [104]:
df.sort_values(by='weight')

   weight  height
3    45.9     143
4    51.2     154
2    65.5     155
1    70.4     180
0    80.0     170

In [105]:
# 행/열 합계
# sum(axis) , axis - 0(열방향, 세로), axis - 1(행방향, 가로)
df2 = pd.DataFrame(np.random.randint(10, size=(4,8)))
df2

   0  1  2  3  4  5  6  7
0  7  8  4  5  4  0  1  5
1  5  5  4  3  1  3  6  8
2  1  9  2  2  3  0  9  5
3  3  7  7  4  7  0  8  2

In [106]:
# 행방향 합계
df2.sum(axis=1)

0    34
1    35
2    31
3    38
dtype: int64

In [107]:
df2['RowSum'] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  7  8  4  5  4  0  1  5      34
1  5  5  4  3  1  3  6  8      35
2  1  9  2  2  3  0  9  5      31
3  3  7  7  4  7  0  8  2      38

In [108]:
df2.sum() # axis = 0은 생략가능, default

0          16
1          29
2          17
3          14
4          15
5           3
6          24
7          20
RowSum    138
dtype: int64

In [109]:
df2.loc['ColSum', :] = df2.sum()
df2

           0     1     2     3     4    5     6     7  RowSum
0        7.0   8.0   4.0   5.0   4.0  0.0   1.0   5.0    34.0
1        5.0   5.0   4.0   3.0   1.0  3.0   6.0   8.0    35.0
2        1.0   9.0   2.0   2.0   3.0  0.0   9.0   5.0    31.0
3        3.0   7.0   7.0   4.0   7.0  0.0   8.0   2.0    38.0
ColSum  16.0  29.0  17.0  14.0  15.0  3.0  24.0  20.0   138.0

In [110]:
# apply() : 행과 열을 반복해서 특정 함수를 이용해 작업할 때
df3 = pd.DataFrame({
    'A':[1, 3, 4, 3, 4],
    'B':[2, 3, 1, 2, 3],
    'C':[1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [111]:
# 각 컬럼별 최대값에서 최소값의 차이를 구하는 작업
df3.apply(lambda x : x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [112]:
# 각 행별 최대값에서 최소값의 차이를 구하는 작업
# lambda 입력 : 출력
func = lambda x : x.max() - x.min()
df3.apply(func, axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [113]:
# value_counts
# 각 열에 어떤 값이 얼마나 사용되었는지를 알고 싶다면
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [114]:
# 정제 : 결측치나 이상치
# NaN => fillna(value)
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [115]:
# is~
# as~ 변환, astype(자료형)
df3.apply(pd.value_counts).fillna(0.0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

In [116]:
# 매직명령어(magic)
%%writefile sample1.csv
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

UsageError: Line magic function `%%writefile` not found.

In [117]:
df4 = pd.read_csv('sample1.csv')
df4

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [119]:
df5 = pd.read_csv('sample2.csv', header = None)
df5

   0     1       2
0  1  1.11     one
1  2  2.22     two
2  3  3.33   three

In [120]:
df6 = pd.read_csv('sample2.csv',
                  names = ['c1', 'c2', 'c3'])
df6

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three